Tekla Open API Reference for Tekla Structures 2025
LevelMarkAttributes Constructor
Overload List
Name | Description
LevelMark.LevelMarkAttributes()
 Initializes a new instance of the LevelMark.LevelMarkAttributes class that loads standard attributes.
LevelMark.LevelMarkAttributes(String)
 Initializes a new instance of the LevelMark.LevelMarkAttributes class that loads the specified attributes.
Top
See Also
Reference
LevelMark.LevelMarkAttributes Class
Tekla.Structures.Drawing Namespace